IsSimilarType Method
 Checks if given type is similar to this type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsSimilarType(
	ElementId typeId
)
Visual Basic
Public Function IsSimilarType ( _
	typeId As ElementId _
) As Boolean
Visual C++
public:
bool IsSimilarType(
	ElementId^ typeId
)
Parameters
typeId
Type: Autodesk.Revit.DBElementId
 ElementId of the type to check.
Return Value
 True if given type is similar to this type, false otherwise.
Remarks
 Two types are similar if elements that have one type could be assigned the other type.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
ElementType Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →